Table of Contents
 Class ConcreteCheckResults
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Concrete Check results
public class ConcreteCheckResults
Inheritance
object
ConcreteCheckResults
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConcreteCheckResults()
Constructor
public ConcreteCheckResults()
Properties
 CheckResults
All results
public List<ConcreteCheckResult> CheckResults { get; set; }
Property Value
List<ConcreteCheckResult>
 Overall
Overal check
public ConcreteCheckResultOverall Overall { get; set; }
Property Value
ConcreteCheckResultOverall
 Edit this page